#!/usr/bin/env bash
# Скриншоты
# Cmd-Shift-3 или Cmd-Shift-4 и выделить область (или выбрать окно пробелом)

# screencapture <имя файла>

# Параметры
# -t <формат> задает формат (по умолчанию PNG)
# -x выключает звук
# -c отправляет скриншот в буфер обмена
# -i интерактивный режим (аналог Cmd-Shift-4)
# -M сразу открывает Mail и создаёт письмо со скриншотом
# -o отключает тень
# -C включает курсор
# -T <секунды> задает задержку перед снятием скриншота
# -b делает скриншот тачбара на новых MacBook Pro
